# Pandas

In [1]:
import pandas as pd

In [2]:
# dataframe --> table & series --> column

In [3]:
# dictionary
data = {
    'wanawake': [30, 20, 10],
    'wanaume': [10, 20, 30]
}

In [4]:
df = pd.DataFrame(data)

In [5]:
df

   wanawake  wanaume
0        30       10
1        20       20
2        10       30

In [6]:
pd.Series([1, 2, 3, 4, 5]) # list

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [7]:
# kusoma .csv
df = pd.read_csv('data.csv')

In [8]:
df

     REGION      DISTRICT     MALE   FEMALE
0    ARUSHA  ARUSHA RURAL  32475.0  33698.0
1    ARUSHA  ARUSHA URBAN  36315.0  36993.0
2    ARUSHA        KARATU  23303.0  23181.0
3    ARUSHA       LONGIDO  10584.0   9045.0
4    ARUSHA          MERU  33854.0  34171.0
..      ...           ...      ...      ...
158   TANGA       LUSHOTO  69395.0  70238.0
159   TANGA        MKINGA  12799.0  12568.0
160   TANGA        MUHEZA  19672.0  19650.0
161   TANGA       PANGANI   4903.0   4925.0
162   TANGA   TANGA URBAN  26555.0  26487.0

[163 rows x 4 columns]

In [9]:
df.shape

(163, 4)

In [10]:
df.head() # rekodi 5 za mwanzo

   REGION      DISTRICT     MALE   FEMALE
0  ARUSHA  ARUSHA RURAL  32475.0  33698.0
1  ARUSHA  ARUSHA URBAN  36315.0  36993.0
2  ARUSHA        KARATU  23303.0  23181.0
3  ARUSHA       LONGIDO  10584.0   9045.0
4  ARUSHA          MERU  33854.0  34171.0

In [11]:
df.tail() # rekodi 5 za mwisho

    REGION     DISTRICT     MALE   FEMALE
158  TANGA      LUSHOTO  69395.0  70238.0
159  TANGA       MKINGA  12799.0  12568.0
160  TANGA       MUHEZA  19672.0  19650.0
161  TANGA      PANGANI   4903.0   4925.0
162  TANGA  TANGA URBAN  26555.0  26487.0

In [12]:
df.columns

Index(['REGION', 'DISTRICT', 'MALE', 'FEMALE'], dtype='object')

In [13]:
# ongeza nguzo (column)
df['TOTAL'] = df['MALE'] + df['FEMALE']

In [14]:
df.head()

   REGION      DISTRICT     MALE   FEMALE    TOTAL
0  ARUSHA  ARUSHA RURAL  32475.0  33698.0  66173.0
1  ARUSHA  ARUSHA URBAN  36315.0  36993.0  73308.0
2  ARUSHA        KARATU  23303.0  23181.0  46484.0
3  ARUSHA       LONGIDO  10584.0   9045.0  19629.0
4  ARUSHA          MERU  33854.0  34171.0  68025.0

In [15]:
# ondoa nguzo
df.drop('TOTAL', axis=1, inplace=True)

In [16]:
df.head()

   REGION      DISTRICT     MALE   FEMALE
0  ARUSHA  ARUSHA RURAL  32475.0  33698.0
1  ARUSHA  ARUSHA URBAN  36315.0  36993.0
2  ARUSHA        KARATU  23303.0  23181.0
3  ARUSHA       LONGIDO  10584.0   9045.0
4  ARUSHA          MERU  33854.0  34171.0

In [17]:
# selection & indexing

In [18]:
df.REGION

0      ARUSHA
1      ARUSHA
2      ARUSHA
3      ARUSHA
4      ARUSHA
        ...
158     TANGA
159     TANGA
160     TANGA
161     TANGA
162     TANGA
Name: REGION, Length: 163, dtype: object

In [19]:
df['REGION']

0      ARUSHA
1      ARUSHA
2      ARUSHA
3      ARUSHA
4      ARUSHA
        ...
158     TANGA
159     TANGA
160     TANGA
161     TANGA
162     TANGA
Name: REGION, Length: 163, dtype: object

In [20]:
df[['REGION', 'DISTRICT']]

     REGION      DISTRICT
0    ARUSHA  ARUSHA RURAL
1    ARUSHA  ARUSHA URBAN
2    ARUSHA        KARATU
3    ARUSHA       LONGIDO
4    ARUSHA          MERU
..      ...           ...
158   TANGA       LUSHOTO
159   TANGA        MKINGA
160   TANGA        MUHEZA
161   TANGA       PANGANI
162   TANGA   TANGA URBAN

[163 rows x 2 columns]

In [22]:
# chuja (filtering)
df[df['REGION'] == 'ARUSHA']

   REGION      DISTRICT     MALE   FEMALE
0  ARUSHA  ARUSHA RURAL  32475.0  33698.0
1  ARUSHA  ARUSHA URBAN  36315.0  36993.0
2  ARUSHA        KARATU  23303.0  23181.0
3  ARUSHA       LONGIDO  10584.0   9045.0
4  ARUSHA          MERU  33854.0  34171.0
5  ARUSHA       MONDULI  13689.0  12888.0
6  ARUSHA    NGORONGORO  16017.0  12162.0

In [23]:
df[df['MALE'] < 4500]

    REGION DISTRICT    MALE  FEMALE
114  PWANI    MAFIA  4284.0  4477.0

In [24]:
df[df['MALE'] > 7500]

     REGION       DISTRICT     MALE   FEMALE
0    ARUSHA   ARUSHA RURAL  32475.0  33698.0
1    ARUSHA   ARUSHA URBAN  36315.0  36993.0
2    ARUSHA         KARATU  23303.0  23181.0
3    ARUSHA        LONGIDO  10584.0   9045.0
4    ARUSHA           MERU  33854.0  34171.0
..      ...            ...      ...      ...
156   TANGA  KOROGWE RURAL  25306.0  25000.0
158   TANGA        LUSHOTO  69395.0  70238.0
159   TANGA         MKINGA  12799.0  12568.0
160   TANGA         MUHEZA  19672.0  19650.0
162   TANGA    TANGA URBAN  26555.0  26487.0

[128 rows x 4 columns]

In [25]:
df.describe()

                MALE         FEMALE
count     133.000000     133.000000
mean    30723.909774   31284.902256
std     18853.800924   19406.712320
min      4284.000000    4477.000000
25%     16823.000000   17030.000000
50%     27554.000000   28264.000000
75%     38260.000000   38332.000000
max    115698.000000  116328.000000

In [26]:
df.shape

(163, 4)

In [27]:
df[df['MALE'] > 115000]

   REGION DISTRICT      MALE    FEMALE
19  GEITA    GEITA  115698.0  116328.0

In [28]:
df[0:5]

   REGION      DISTRICT     MALE   FEMALE
0  ARUSHA  ARUSHA RURAL  32475.0  33698.0
1  ARUSHA  ARUSHA URBAN  36315.0  36993.0
2  ARUSHA        KARATU  23303.0  23181.0
3  ARUSHA       LONGIDO  10584.0   9045.0
4  ARUSHA          MERU  33854.0  34171.0

In [29]:
df.head()

   REGION      DISTRICT     MALE   FEMALE
0  ARUSHA  ARUSHA RURAL  32475.0  33698.0
1  ARUSHA  ARUSHA URBAN  36315.0  36993.0
2  ARUSHA        KARATU  23303.0  23181.0
3  ARUSHA       LONGIDO  10584.0   9045.0
4  ARUSHA          MERU  33854.0  34171.0

In [30]:
# indexing

In [31]:
# .loc
# .iloc

In [32]:
df.loc[0, 'REGION']

'ARUSHA'

In [34]:
df.loc[4, 'DISTRICT']

'MERU'

In [37]:
df.loc[:, ['REGION', 'DISTRICT']].head()

   REGION      DISTRICT
0  ARUSHA  ARUSHA RURAL
1  ARUSHA  ARUSHA URBAN
2  ARUSHA        KARATU
3  ARUSHA       LONGIDO
4  ARUSHA          MERU

In [38]:
df.iloc[0, 0]

'ARUSHA'

In [39]:
df.iloc[4, 1]

'MERU'

In [40]:
df.iloc[:, [0, 1]].head()

   REGION      DISTRICT
0  ARUSHA  ARUSHA RURAL
1  ARUSHA  ARUSHA URBAN
2  ARUSHA        KARATU
3  ARUSHA       LONGIDO
4  ARUSHA          MERU

In [41]:
# sorting (panga data)

In [42]:
d = df.sort_values(by='FEMALE', ascending=False)
d

            REGION       DISTRICT      MALE    FEMALE
19           GEITA          GEITA  115698.0  116328.0
8    DAR ES SALAAM      KINONDONI   91554.0   93921.0
9    DAR ES SALAAM         TEMEKE   85118.0   88813.0
134         SIMIYU  BARIADI RURAL   75089.0   79153.0
7    DAR ES SALAAM          ILALA   73129.0   78309.0
..             ...            ...       ...       ...
137         SIMIYU        ITILIMA       NaN       NaN
140        SINGIDA         IKUNGI       NaN       NaN
143        SINGIDA        MKALAMA       NaN       NaN
147         TABORA         KALIUA       NaN       NaN
153          TANGA        BUMBULI       NaN       NaN

[163 rows x 4 columns]

In [43]:
# kuhifadhi (save df)

In [44]:
df

     REGION      DISTRICT     MALE   FEMALE
0    ARUSHA  ARUSHA RURAL  32475.0  33698.0
1    ARUSHA  ARUSHA URBAN  36315.0  36993.0
2    ARUSHA        KARATU  23303.0  23181.0
3    ARUSHA       LONGIDO  10584.0   9045.0
4    ARUSHA          MERU  33854.0  34171.0
..      ...           ...      ...      ...
158   TANGA       LUSHOTO  69395.0  70238.0
159   TANGA        MKINGA  12799.0  12568.0
160   TANGA        MUHEZA  19672.0  19650.0
161   TANGA       PANGANI   4903.0   4925.0
162   TANGA   TANGA URBAN  26555.0  26487.0

[163 rows x 4 columns]

In [45]:
df.to_csv('new_data.csv', index=False)

In [46]:
# unganisha dataframe

In [47]:
df1 = df.head()
df2 = df.tail()

In [48]:
df1

   REGION      DISTRICT     MALE   FEMALE
0  ARUSHA  ARUSHA RURAL  32475.0  33698.0
1  ARUSHA  ARUSHA URBAN  36315.0  36993.0
2  ARUSHA        KARATU  23303.0  23181.0
3  ARUSHA       LONGIDO  10584.0   9045.0
4  ARUSHA          MERU  33854.0  34171.0

In [49]:
df2

    REGION     DISTRICT     MALE   FEMALE
158  TANGA      LUSHOTO  69395.0  70238.0
159  TANGA       MKINGA  12799.0  12568.0
160  TANGA       MUHEZA  19672.0  19650.0
161  TANGA      PANGANI   4903.0   4925.0
162  TANGA  TANGA URBAN  26555.0  26487.0

In [54]:
new_df = pd.concat([df1, df2], ignore_index=True)

In [55]:
new_df

   REGION      DISTRICT     MALE   FEMALE
0  ARUSHA  ARUSHA RURAL  32475.0  33698.0
1  ARUSHA  ARUSHA URBAN  36315.0  36993.0
2  ARUSHA        KARATU  23303.0  23181.0
3  ARUSHA       LONGIDO  10584.0   9045.0
4  ARUSHA          MERU  33854.0  34171.0
5   TANGA       LUSHOTO  69395.0  70238.0
6   TANGA        MKINGA  12799.0  12568.0
7   TANGA        MUHEZA  19672.0  19650.0
8   TANGA       PANGANI   4903.0   4925.0
9   TANGA   TANGA URBAN  26555.0  26487.0

In [56]:
new_df.shape

(10, 4)

In [57]:
# append

In [58]:
df1

   REGION      DISTRICT     MALE   FEMALE
0  ARUSHA  ARUSHA RURAL  32475.0  33698.0
1  ARUSHA  ARUSHA URBAN  36315.0  36993.0
2  ARUSHA        KARATU  23303.0  23181.0
3  ARUSHA       LONGIDO  10584.0   9045.0
4  ARUSHA          MERU  33854.0  34171.0

In [59]:
df2

    REGION     DISTRICT     MALE   FEMALE
158  TANGA      LUSHOTO  69395.0  70238.0
159  TANGA       MKINGA  12799.0  12568.0
160  TANGA       MUHEZA  19672.0  19650.0
161  TANGA      PANGANI   4903.0   4925.0
162  TANGA  TANGA URBAN  26555.0  26487.0

In [60]:
df1.append(df2, ignore_index=True)

   REGION      DISTRICT     MALE   FEMALE
0  ARUSHA  ARUSHA RURAL  32475.0  33698.0
1  ARUSHA  ARUSHA URBAN  36315.0  36993.0
2  ARUSHA        KARATU  23303.0  23181.0
3  ARUSHA       LONGIDO  10584.0   9045.0
4  ARUSHA          MERU  33854.0  34171.0
5   TANGA       LUSHOTO  69395.0  70238.0
6   TANGA        MKINGA  12799.0  12568.0
7   TANGA        MUHEZA  19672.0  19650.0
8   TANGA       PANGANI   4903.0   4925.0
9   TANGA   TANGA URBAN  26555.0  26487.0

In [61]:
# grouping

In [62]:
groups = df.groupby(['REGION'])

In [63]:
groups

In [65]:
groups.count()['DISTRICT']

REGION
ARUSHA            7
DAR ES SALAAM     3
DODOMA            7
GEITA             6
IRINGA            4
KAGERA            8
KATAVI            4
KIGOMA            7
KILIMANJARO       7
LINDI             6
MANYARA           6
MARA              8
MBEYA            10
MOROGORO          7
MTWARA            7
MWANZA            7
NJOMBE            6
PWANI             7
RUKWA             4
RUVUMA            6
SHINYANGA         7
SIMIYU            6
SINGIDA           6
TABORA            7
TANGA            10
Name: DISTRICT, dtype: int64

In [66]:
groups.groups

{'ARUSHA': [0, 1, 2, 3, 4, 5, 6], 'DAR ES SALAAM': [7, 8, 9], 'DODOMA': [10, 11, 12, 13, 14, 15, 16], 'GEITA': [17, 18, 19, 20, 21, 22], 'IRINGA': [23, 24, 25, 26], 'KAGERA': [27, 28, 29, 30, 31, 32, 33, 34], 'KATAVI': [35, 36, 37, 38], 'KIGOMA': [39, 40, 41, 42, 43, 44, 45], 'KILIMANJARO': [46, 47, 48, 49, 50, 51, 52], 'LINDI': [53, 54, 55, 56, 57, 58], 'MANYARA': [59, 60, 61, 62, 63, 64], 'MARA': [65, 66, 67, 68, 69, 70, 71, 72], 'MBEYA': [73, 74, 75, 76, 77, 78, 79, 80, 81, 82], 'MOROGORO': [83, 84, 85, 86, 87, 88, 89], 'MTWARA': [90, 91, 92, 93, 94, 95, 96], 'MWANZA': [97, 98, 99, 100, 101, 102, 103], 'NJOMBE': [104, 105, 106, 107, 108, 109], 'PWANI': [110, 111, 112, 113, 114, 115, 116], 'RUKWA': [117, 118, 119, 120], 'RUVUMA': [121, 122, 123, 124, 125, 126], 'SHINYANGA': [127, 128, 129, 130, 131, 132, 133], 'SIMIYU': [134, 135, 136, 137, 138, 139], 'SINGIDA': [140, 141, 142, 143, 144, 145], 'TABORA': [146, 147, 148, 149, 150, 151, 152], 'TANGA': [153, 154, 155, 156, 157, 158, 159, 160, 161, 162]}